# BuiltInFailures.DimensionFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures Class
BuiltInFailures Class Members See Also
---
Failures about DimensionFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DimensionFailures
```

Visual Basic
---
```text
Public NotInheritable Class DimensionFailures
```

Visual C++
---
```text
public ref class DimensionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DimensionFailures
# See Also
BuiltInFailures..::..DimensionFailures Members
Autodesk.Revit.DB Namespace